In [1]:
import pandas as pd
from datetime import datetime
from IPython.display import display
import warnings
warnings.filterwarnings("ignore")

Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.
Intel MKL WARNING: Support of Intel(R) Streaming SIMD Extensions 4.2 (Intel(R) SSE4.2) enabled only processors has been deprecated. Intel oneAPI Math Kernel Library 2025.0 will require Intel(R) Advanced Vector Extensions (Intel(R) AVX) instructions.

In [2]:
from spendings import MoneySpendings

In [3]:
df = pd.read_csv("Spendings_csv.csv", parse_dates=["Date"], date_format="%d/%m/%Y")

In [4]:
test = MoneySpendings(df)

In [6]:
test.info_by_month(month=6)

Spendings in June: 12087.78 sheckels
Spendings in June with the appartment: 17787.78 sheckels

                 Price  Count
Category
Grocery        2805.48     20
Health         2725.00     13
Entertainment  1300.00      5
Home           1230.70      9
Presents        956.00      6
Restaurants     864.90      9
Fuel            840.00      3
Treatment       491.20      5
Beauty          480.00      4
Parking         209.00      5
Utility bills    94.50      2
Education        71.00      1
Auto             20.00      1

         Price  Price_apt
Who
Alona  6137.35    8987.35
Pasha  5950.43    8800.43